org/_posts/2023-11-05-derivas-del-bazar.org
#+OPTIONS: toc:nil num:nil ^:{}
#+LANGUAGE: es
#+BEGIN_EXPORT html
---
layout: post
title: "Derivas del bazar"
date: 2023-11-05 13:25:02
tags: [software, utopías]
image: assets/img/libre.jpg
excerpt: Linux y Wikipedia demostraron, durante lo que posiblemente haya sido el período de mayor hegemonía del individualismo liberal, que la innovación y el bien público son mejor propiciadas por la colaboración voluntaria entre pares que por la competencia de mercado.
---
#+END_EXPORT

* Las leyes de Linus

Si pudiera salvar dos cosas del fuego de internet, serían Linux y Wikipedia. Linux y Wikipedia me parecen los mayores logros recientes de la humanidad por razones mejor expresadas en las dos /Leyes de Linus/.

La primera ley de Linus la escribió Eric Raymond en su ensayo /The Cathedral and the Bazaar/:

#+begin_quote
Given a large enough beta-tester and co-developer base, almost every problem will be characterized quickly and the fix obvious to someone.
#+end_quote

O, más informalmente:

#+begin_quote
Given enough eyeballs, all bugs are shallow.
#+end_quote

Aunque se refiera explícitamente al debugging, esta ley sintetiza el argumento de la catedral y el bazar sobre el desarrollo de software: el modelo aparentemente caótico del open source, semejante al tumulto de un bazar, no solo puede producir software funcional sino que de hecho produce /mejor/ software que la ceremoniosa catedral del software privado. Prueba de esto es que, después de Linux y Wikipedia ---resultados de aquel modelo---, a nadie se le ocurriría pagar por una licencia de Encarta o deployar un servidor con Windows.

Pero hay otra ley de Linus, menos conocida, expuesta por el propio Torvalds en su prólogo al libro /The Hacker Ethic/ de Pekka Himanen:

#+begin_quote
Linus’s Law says that all of our motivations fall into three basic categories. The categories, in order, are “survival”, “social life”, and “entertainment”.

Entertainment may sound like a strange choice, but I mean by entertainment more than just playing games on your Nintendo. It’s chess. It’s painting. It’s the mental gymnastics involved in trying to explain the universe. Einstein wasn’t motivated by survival when he was thinking about physics. Nor was it probably very social. It was entertainment to him. Entertainment is something intrinsically interesting and challenging.

A “hacker” is a person who has gone past using his computer for survival to the next two stages. That is how something like Linux comes about. You don’t worry about making that much money. The reason that Linux hackers do something is that they find it to be very interesting, and they like to share this interesting thing with others. Suddenly, you get both entertainment from the fact that you are doing something interesting, and you also get the social part. This is how you have this fundamental Linux networking effect where you have a lot of hackers working together because they enjoy what they do. Hackers believe that there is no higher stage of motivation than that.
#+end_quote

Torvalds dice lo que saben muchos programadores[fn:1], pero también muchos investigadores, docentes y artistas: satisfechas las necesidades humanas básicas (la supervivencia), el trabajo creativo se vuelve un fin en sí mismo, un estímulo mucho más fuerte que la ganancia económica.

Ese "entretenimiento", que Himanen prefiere llamar pasión, explica por qué hay programadores trabajando gratis en su tiempo libre. La "vida social" explica por qué comparten el fruto de ese trabajo, por qué forman comunidades y colaboran en tareas menos interesantes, como el debugging o la documentación. Tanto Raymond como Himanen sostienen que la gratificación para los hackers es el prestigio y el reconocimiento de sus pares. Aplicando un poco de antropología inchequeable proponen que, en contextos de abundancia, en lugar de una economía de mercado las comunidades se inclinan hacia una "cultura del regalo", en la que el estatus social deriva no de lo que se posee si no de lo que se entrega a los demás[fn:7].

La abundancia de la que gozan los hackers es doble. En primer término, refiere a la abundancia material que es requisito para poder perseguir sus intereses: los hackers necesitan el privilegio de la seguridad económica, del acceso a una computadora y a internet, y del tiempo libre. La otra forma de abundancia es la propia de la información digital: una vez producida un obra (un programa, una fotografía, una canción), reproducirla tiene costo virtualmente nulo[fn:4].
Es solo mediante una imposición artificial de escasez ---aplicando licencias o restricciones de acceso--- que la información se transforma en mercancía. La cultura del regalo es lo natural para el hacker porque, en ese modelo, compartir su trabajo no le cuesta nada.

Combinando las dos leyes de Linus vemos que, en las condiciones adecuadas, las personas están dispuestas a trabajar sin compensación económica y que de ese trabajo resultan bienes de mejor calidad que de las relaciones capitalistas. Linux y Wikipedia demostraron, durante lo que posiblemente haya sido el período de mayor hegemonía del individualismo liberal, que la innovación y el bien público son mejor propiciadas por la colaboración voluntaria entre pares que por la competencia de mercado.

