org/_posts/2023-11-05-derivas-del-bazar.org
* Apertura estratégica

A principios del siglo XXI, la superioridad moral y técnica de Linux y Wikipedia parecían anunciar que la web traía un cambio de paradigma en la producción intelectual. Volvamos ahora al presente y preguntémonos qué fue del bazar. ¿Son la producción colaborativa y la inteligencia colectiva la norma en la era de la información? Después de que internet se globalizara y se masificara y permeara todos los aspectos de la vida, ¿hubo otros Linux y Wikipedia? ¿Podría volver a haberlos?

Así como el concierto de voluntades que produjo y mantiene Wikipedia hace impensable un negocio alrededor de las enciclopedias, hoy nos resulta igualmente difícil de imaginar a un número semejante de voluntades organizándose sin un negocio de por medio. Esto podría sugerir que la vocación colaborativa de la web temprana se disipó después de aquel primer ímpetu pero, si miramos con atención, vemos que la colaboración todavía existe, ahora bajo el control y para el beneficio de  empresas privadas. Todavía hay quienes se dedican voluntariamente a la producción de contenido, motivados solamente por el estatus comunitario, pero el producto de ese trabajo no fluye libremente sino que queda encerrado en los confines de las plataformas digitales. Un caso paradigmático es el de Reddit, que no solo aprovecha el contenido provisto por los usuarios sino que se sostiene en buena medida sobre la tarea de sus moderadores. Otros casos parecidos son los de StackOverflow y Goodreads.

Benjamin Mako Hill explica que las empresas tomaron nota de los beneficios de la producción colaborativa de la web y ahora buscan reproducirla en sus productos, en lo que llama apertura estratégica (/strategic openness/), para favorecer sus negocios:

#+begin_quote
Strategic openness means that companies will carefully design systems that allow for mass collaboration but they try to tightly control where collaboration can happen and where it can't. (...) The app store model, more than anything before it, was a discovery of how big companies can benefit from finding something that looked like peer production or "open source", without having to get their hands covered in freedom.
#+end_quote

Mako Hill estudia el caso de Airbnb, que montó un negocio alrededor de mecanismos e incentivos que habían funcionado en la comunidad de Couchsurfing.

Aunque la tecnología y las motivaciones de las personas sean las mismas, invadida por la lógica de mercado, la cultura del regalo se desmorona. Y lo que antes era una construcción comunitaria pasa a ser trabajo no remunerado, explotación. El griego Yanis Varoufakis va más lejos y propone que en la economía contemporánea las relaciones capitalistas pasaron a un segundo plano y que el sistema dominante es una especie de feudalismo tecnológico, en el que todos los usuarios de software somos "siervos", de una u otra forma pagándole rentas a los señores de la nube. De eso se tratan las redes sociales en las que pagamos con nuestra atención, los servicios de contenidos que pagamos con suscripciones, los /e-commerces/ y las /app stores/ en los que las plataformas recogen un porcentaje de todas las transacciones.

* Del bazar al maxikiosco

Así que por el momento no habrá más Wikipedias pero ¿qué pasa con el software? Daría la impresión de que el open source está más vivo que nunca, con la mayoría de los dispositivos del mundo y casi todos los servidores usando Linux, con la mayoría de los sistemas de software dependiendo de una u otra forma del código abierto. Pero si observamos quién hace el trabajo y quién recoge los beneficios, o si sencillamente googleamos "open source maintainers", resulta obvio que el software libre y abierto atraviesa una crisis:

1. /No alcanzan los ojos (ni las manos) para realizar la primera ley de Linus/: que un proyecto tenga muchos usuarios no implica que haya programadores interesados o en condiciones de mantenerlo; que sea usado en un contexto comercial no implica que algo de las ganancias le llegue a sus autores.
2. /Las motivaciones de la segunda ley de Linus se mezclaron con incentivos de mercado/: la producción de software open source pasó de ser un entretenimiento a un medio para demostrar competencia profesional, una forma de acceso a mejores trabajos. Lo que antes era un bazar, ahora es un montón de kiosquitos. La reputación que se pone en juego en el open source genera sobre los voluntarios la obligación de mantener sus proyectos porque ahora hay personas y empresas que dependen de su trabajo.
3. /Sigue sin existir la abundancia material/, impidiendo la sustentabilidad de la cultura del regalo. Quienes pretenden vivir del software abierto que producen, lo tienen que hacer eligiendo la inseguridad económica, dependiendo de donaciones discrecionales; quienes optan por montar negocios alrededor de ese software, llevan las de perder en la competencia contra empresas de más recursos, que no necesitan ser innovadoras ni están atadas por obligaciones hacia su comunidad y sus usuarios.
4. /Las ventajas del bazar ya no están fuera del alcance de las empresas privadas/. Lejos de la animosidad del viejo Microsoft, hoy todas las empresas Big Tech usan, producen y financian software open source. Los recursos de los que disponen las posiciona mejor para formar comunidades y apalancarse en el trabajo voluntario sin ceder el control de sus proyectos, en lo que constituye otra forma de apertura estratégica: complementan el entretenimiento y la vida social de la ley de Linus con los incentivos económicos del mercado.

Que proyectos neurálgicos para la industria como OpenSSL puedan pasar años sin financiamiento, que la seguridad de internet sea responsabilidad de un puñado de voluntarios no habla de mezquindad de las corporaciones (que, a fin de cuentas, tienen mucho para perder en el abandono del software del que dependen) sino de una falencia sistémica: los incentivos y las regulaciones no encarrilan a los actores hacia la sustentabilidad.

Daría la impresión de que, tal como Wikipedia, Linux fue menos un punto de partida que la culminación de la cultura Hacker de las décadas anteriores.

