_posts/2023-11-05-derivas-del-bazar.html

<div id="outline-container-org767ea90" class="outline-2">
<h2 id="org767ea90">Libre como un taxi</h2>
<div class="outline-text-2" id="text-org767ea90">
<p>
Es tentador pensar que la crisis del bazar era la consecuencia inevitable del <i>Gran Cisma</i> del software libre, que la pelea empezó a perderse cuando los hackers optaron por las licencias permisivas y pro-negocios del open source. ¿Será el copyleft la herramienta adecuada para refundar el bazar y protegerlo de los embates del mercado? Desde mi pinto de vista, por noble e inspiradora que sea, la intransigencia del software libre resulta en última instancia inocua y un poco elitista:
</p>

<ol class="org-ol">
<li><i>Sobrestima la libertad de modificar y redistribuir el código fuente</i>, residuo de la época en que un usuario de software era aproximadamente lo mismo que un programador. En aquel contexto, limitar el acceso al código era romper aquello justificaba la existencia de las computadoras. Hoy ni siquiera los usuarios que saben programar tienen la necesidad, el interés o el tiempo de modificar el software que usan cotidianamente. Aunque sea preferible tener acceso al código a no tenerlo, como libertad sirve a una minoría privilegiada, es un derecho mucho menos urgente que la privacidad, la no manipulación, la interoperabilidad, etc.<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>.</li>
<li><i>Pone a su ética como única motivación</i>. Como supone que la libertad de código es <i>esencial</i> para los usuarios de software y para la sociedad en general, como es <i>lo que está bien</i>, debería ser suficiente razón para perseguirla. En contraste con las motivaciones sociales e intelectuales de la ley de Linus, con la promesa de calidad técnica de la iniciativa open source y con el potencial de ganancia de la economía de mercado, el movimiento de software libre carece de incentivos para reproducirse a sí mismo, necesita para extenderse del activismo de un grupo previamente convencido de sus argumentos<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>.</li>
<li><i>Subestima la gratuidad del software</i>. A pesar de la famosa frase "free speech, not free beer" y a la intención de compatibilizar con el mercado, creo que la gratuidad del software libre y abierto es un factor determinante, que puede no haber sido un incentivo para su desarrollo pero que explica su posterior masificación. La razón por la que Linux es el sistema operativo predeterminado para casi cualquier dispositivo o de que nadie dude en aprovechar las librerías abiertas para construir su propio programa es que son elecciones sin costo económico. La gratuidad democratiza el acceso al software, nos acerca algo de aquella abundancia que es requisito para su proliferación. Sin gratuidad no hay regalo, sin cultura del regalo no hay bazar, sin bazar no se puede competir técnicamente con el software privado.</li>
</ol>

<p>
El problema de fondo es que el bazar representa un modo de producción alternativo al mercado capitalista y, en última instancia, incompatible con él. Y, como suele ser el caso con toda alternativa al capitalismo, el sistema tiende a absorberla o destruirla:
</p>
<ul class="org-ul">
<li>El software libre ejercía un activismo intransigente pero que se cuidaba de no extender su argumento más allá del software, por ejemplo rechazando otras formas de escasez artificial y propiedad intelectual. Es decir, no se enfrentaba directamente al mercado pero tampoco se adaptaba a él: pretendía formar una masa crítica para forzar al mercado a aceptar sus condiciones. Como eso no sucedió, el software libre virtualmente se extinguió ante las alternativas más flexibles<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>.</li>
<li>El open source adoptó una postura permisiva que allanó el camino para que se propague como virus<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>, a la vez que lo expuso a ser cooptado y abusado por las corporaciones privadas.</li>
</ul>

<p>
Los dos movimientos estaban condenados al fracaso porque su subsistencia requería unas condiciones de abundancia que no existen de hecho en el mercado capitalista, y que ninguno de los dos estaba diseñado para propiciar.
</p>
</div>
</div>

<div id="outline-container-orgc824c88" class="outline-2">
<h2 id="orgc824c88">Derivas del bazar</h2>
<div class="outline-text-2" id="text-orgc824c88">
<p>
En el mundo de hoy, los constructores de software pueden tomar dos caminos:
</p>

<ol class="org-ol">
<li><i>Tratar de preservar la cultura del regalo en el contexto capitalista</i>: continuar produciendo software por entretenimiento o por prestigio, sin expectativas de ganancia, ya sea exponiéndose a que otros se beneficien económicamente de su trabajo (como pasa con el open source) o protegiéndolo con recursos legales, al posible costo de perder usuarios (como pasa con el software libre). En cualquiera de los dos casos, la actividad creativa seguirá siendo privilegio de quienes dispongan de seguridad económica y tiempo libre.</li>
<li><i>Abrazar la economía de mercado</i>: tratando de convertir su trabajo en negocio, complementando la producción de software con tareas lucrativas, optando por desarrollar el tipo de software que tiene más posibilidades de popularizarse, aplicando apertura estratégica para ser competitivos.</li>
</ol>

<p>
Puesto en esos términos, el problema de la producción independiente de software y su sustentabilidad se parece al del arte y hasta de la investigación científica. Tomando como ejemplo a los escritores, los hay quienes tienen la vida resuelta económicamente y pueden dedicarse a la literatura; los que se la toman como un hobby o vocación creativa, robándole horas al sueño, sin expectativas de éxito; los <i>bestsellers</i> que encuentran una veta comercial y pueden vivir de su trabajo; los independientes que tienen que complementar su actividad con docencia y trabajo periodístico; los que viven de becas y concursos, etc.
</p>

<p>
Hay, claro, una tercera posición: tratar de cambiar el <i>statu quo</i> por otro más justo, en el que quien contribuya software útil para la sociedad y, especialmente, software que pueda ser explotado comercialmente, reciba suficiente rédito para subsistir y continuar ejerciendo esa actividad. Es un camino que implica adentrarse en el terreno del idealismo y del activismo, en la política, en fin, en proporciones mucho más ambiciosas de lo que lo había hecho el movimiento de software libre. Implica atacar un problema que excede (y precede) a la producción de software, el mismo que tienen artistas y científicos, un problema no técnico sino socioeconómico que, como tal, no puede ser resuelto "endogámicamene" con tecnología o piruetas legales.
</p>

<p>
En efecto, sería deseable que cambiara la cultura para que los usuarios paguen por el software que usan; que los estados subsidiaran el desarrollo y que las corporaciones estuvieran obligadas legalmente a retribuir en proporción al beneficio que extraen. Un mundo así sería deseable, más justo, pero no el mundo ideal: el mundo ideal sería uno que garantizara la abundancia que posibilita la cultura del regalo. Porque, ¿quién hubiera financiado a un estudiante finlandés desconocido para que desarrolle un núcleo de Unix en 1991? ¿Quién sabe si el entusiasmo comunitario del bazar hubiera brotado con la mediación de partes interesadas? Lo que posibilitó Linux no fue la financiación estatal ni la posibilidad de explotación comercial, fue que Linus Torvalds tenía techo y comida, una computadora, acceso a internet, tiempo libre y pocas obligaciones familiares.
</p>

<p>
El mundo ideal, aquel que maximizaría no solo la innovación sino la gratificación de los individuos y las comunidades, aquel en el que florecerían dos, tres, muchos Linux y Wikipedias, sería uno de abundancia, uno en el que las necesidades básicas estuvieran garantizadas para todos, incondicionalmente. Para que cualquiera pudiera entregarse despreocupadamente a hacer su trabajo, no porque otros lo consideran útil o necesario, no porque haya quien lo pague o una autoridad que así lo exija, sino porque quiere, porque ahí lo lleva el deseo, porque así lo dicta la curiosidad, el interés, la inspiración, la vocación, la pasión.
</p>
</div>
