org/_posts/2023-11-05-derivas-del-bazar.org
** Fuentes

- [[http://www.catb.org/~esr/writings/cathedral-bazaar/cathedral-bazaar/][/The Cathedral and the Bazaar/]], Eric S. Raymond.
- /The Hacker Ethic and the Spirit of the Information Age/, Pekka Himanen, Linus Torvalds.
- [[http://www.catb.org/~esr/writings/homesteading/homesteading/][/Homesteading the Noosphere/]], Eric S. Raymond.
- [[https://firstmonday.org/ojs/index.php/fm/article/download/631/552?inline=1][/The High-Tech Gift Economy/]], Richard Barbrook.
- [[https://mako.cc/copyrighteous/libreplanet-2018-keynote][/How markets coopted free software’s most powerful weapon/]], Benjamin Mako Hill.
- /Technofeudalism: What Killed Capitalism/, Yanis Varoufakis.
- [[https://stratechery.com/2019/aws-mongodb-and-the-economic-realities-of-open-source/][/AWS, MongoDB, and the Economic Realities of Open Source/]], Ben Thompson.
- [[http://veridicalsystems.com/blog/of-money-responsibility-and-pride/][/Of Money, Responsibility, and Pride/]], Steve Marquess.
- [[https://increment.com/open-source/the-rise-of-few-maintainer-projects/][/The rise of few-maintainer projects/]], Nadia Eghbal.
- [[https://trstringer.com/oss-compensation-broken/][/The Lack of Compensation in Open Source Software is Unsustainable/]], Thomas Stringer.
- [[https://www.gnu.org/philosophy/open-source-misses-the-point.html][/Why Open Source Misses the Point of Free Software/]], Richard Stallman.
- [[https://www.boringcactus.com/2020/08/13/post-open-source.html][/Post-Open Source/]], Melody Horn.
- [[https://dev.to/zkat/a-system-for-sustainable-foss-11k9][/A System for Sustainable FOSS/]], Kat Marchán.
- [[https://logicmag.io/failure/freedom-isnt-free/][/Freedom isn't Free/]], Wendy Liu.
- [[https://notesfrombelow.org/article/open-source-is-not-enough][/Open Source is Not Enough/]], James Halliday.
- /How to Be an Anticapitalist in the Twenty-First Century/, Erik Olin Wright.
- /Los caminos de la libertad/, Bertrand Russell.
- [[https://jacobin.com/2015/03/socialism-innovation-capitalism-smith/][/Red Innovation/]], Tony Smith.
- [[https://jacobin.com/2016/02/free-software-movement-richard-stallman-linux-open-source-enclosure/][/Reclaiming the Computing Commons/]], Rob Hunter.

** Footnotes

[fn:7] Raymond habla de [[https://en.wikipedia.org/wiki/Gift_economy][/gift culture/]]. Ver también [[https://en.wikipedia.org/wiki/Sharing_economy][/sharing economy/]] y [[https://en.wikipedia.org/wiki/Commons-based_peer_production][/commons-based peer production/]].

[fn:6] Es curioso que, pese a esquivar la ideología y a adoptar una postura explícitamente pro-mercado, el open source terminó haciendo una mayor contribución que el software libre a la mirada anticapitalista, por ser un mejor ejemplo de innovación sin incentivos económicos.

[fn:5] Puede considerarse que copyleft /es/ un mecanismo de reproducción para el software libre, pero en la práctica parece más frecuentemente resultar en que se evite usarlo antes que en la adopción de sus condiciones.

[fn:3] Se puede argumentar que esos otros atributos podrían garantizarse si de hecho existiera el acceso al código, pero centrar el activismo en la libertad de código como un fin al que todo otro derecho es subsidiario, es como proponer que la mejor manera de combatir el cambio climático es desmantelar el capitalismo.

[fn:2] Aunque, estrictamente hablando, Linux sea software libre con una licencia copyleft restrictiva, su vigencia se debe justamente a que esa licencia no previene la producción de software cerrado: se puede desarrollar y deployar software privado usando Linux, sin obligaciones hacia los usuarios finales de ese software.

[fn:4] A tal punto el libre acceso a la información era el /statu quo/ en las décadas de los 70 y 80,
que Bill Gates hizo un [[https://en.wikipedia.org/wiki/An_Open_Letter_to_Hobbyists][famoso berrinche]] porque la gente distribuía su software sin pagarle y Richard Stallman hizo un [[https://www.fsf.org/blogs/community/201cthe-printer-story201d-redux-a-testimonial-about-the-injustice-of-proprietary-firmware][famoso berrinche]] porque no le dejaban cambiar el firmware de una impresora.

[fn:1] Himanen cita a Steve Wozniak, que expresa una filosofía de vida equivalente a la ley de Linus (/H = F^{3}, Happiness equals food, fun and friends/), y vincula a los dos con la [[https://es.wikipedia.org/wiki/Pir%C3%A1mide_de_Maslow][jerarquía de las necesidades humanas de Maslow]].
