_posts/2023-11-05-derivas-del-bazar.html

<div id="outline-container-org5ccd32e" class="outline-3">
<h3 id="org5ccd32e">Fuentes</h3>
<div class="outline-text-3" id="text-org5ccd32e">
<ul class="org-ul">
<li><a href="http://www.catb.org/~esr/writings/cathedral-bazaar/cathedral-bazaar/"><i>The Cathedral and the Bazaar</i></a>, Eric S. Raymond.</li>
<li><i>The Hacker Ethic and the Spirit of the Information Age</i>, Pekka Himanen, Linus Torvalds.</li>
<li><a href="http://www.catb.org/~esr/writings/homesteading/homesteading/"><i>Homesteading the Noosphere</i></a>, Eric S. Raymond.</li>
<li><a href="https://firstmonday.org/ojs/index.php/fm/article/download/631/552?inline=1"><i>The High-Tech Gift Economy</i></a>, Richard Barbrook.</li>
<li><a href="https://mako.cc/copyrighteous/libreplanet-2018-keynote"><i>How markets coopted free software’s most powerful weapon</i></a>, Benjamin Mako Hill.</li>
<li><i>Technofeudalism: What Killed Capitalism</i>, Yanis Varoufakis.</li>
<li><a href="https://stratechery.com/2019/aws-mongodb-and-the-economic-realities-of-open-source/"><i>AWS, MongoDB, and the Economic Realities of Open Source</i></a>, Ben Thompson.</li>
<li><a href="http://veridicalsystems.com/blog/of-money-responsibility-and-pride/"><i>Of Money, Responsibility, and Pride</i></a>, Steve Marquess.</li>
<li><a href="https://increment.com/open-source/the-rise-of-few-maintainer-projects/"><i>The rise of few-maintainer projects</i></a>, Nadia Eghbal.</li>
<li><a href="https://trstringer.com/oss-compensation-broken/"><i>The Lack of Compensation in Open Source Software is Unsustainable</i></a>, Thomas Stringer.</li>
<li><a href="https://www.gnu.org/philosophy/open-source-misses-the-point.html"><i>Why Open Source Misses the Point of Free Software</i></a>, Richard Stallman.</li>
<li><a href="https://www.boringcactus.com/2020/08/13/post-open-source.html"><i>Post-Open Source</i></a>, Melody Horn.</li>
<li><a href="https://dev.to/zkat/a-system-for-sustainable-foss-11k9"><i>A System for Sustainable FOSS</i></a>, Kat Marchán.</li>
<li><a href="https://logicmag.io/failure/freedom-isnt-free/"><i>Freedom isn't Free</i></a>, Wendy Liu.</li>
<li><a href="https://notesfrombelow.org/article/open-source-is-not-enough"><i>Open Source is Not Enough</i></a>, James Halliday.</li>
<li><i>How to Be an Anticapitalist in the Twenty-First Century</i>, Erik Olin Wright.</li>
<li><i>Los caminos de la libertad</i>, Bertrand Russell.</li>
<li><a href="https://jacobin.com/2015/03/socialism-innovation-capitalism-smith/"><i>Red Innovation</i></a>, Tony Smith.</li>
<li><a href="https://jacobin.com/2016/02/free-software-movement-richard-stallman-linux-open-source-enclosure/"><i>Reclaiming the Computing Commons</i></a>, Rob Hunter.</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<!--h2 class="footnotes">Nota al pie de p&aacute;gina: </h2-->
<h3 class="footnotes">Notas: </h3>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Himanen cita a Steve Wozniak, que expresa una filosofía de vida equivalente a la ley de Linus (<i>H = F<sup>3</sup>, Happiness equals food, fun and friends</i>), y vincula a los dos con la <a href="https://es.wikipedia.org/wiki/Pir%C3%A1mide_de_Maslow">jerarquía de las necesidades humanas de Maslow</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Raymond habla de <a href="https://en.wikipedia.org/wiki/Gift_economy"><i>gift culture</i></a>. Ver también <a href="https://en.wikipedia.org/wiki/Sharing_economy"><i>sharing economy</i></a> y <a href="https://en.wikipedia.org/wiki/Commons-based_peer_production"><i>commons-based peer production</i></a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
A tal punto el libre acceso a la información era el <i>statu quo</i> en las décadas de los 70 y 80,
que Bill Gates hizo un <a href="https://en.wikipedia.org/wiki/An_Open_Letter_to_Hobbyists">famoso berrinche</a> porque la gente distribuía su software sin pagarle y Richard Stallman hizo un <a href="https://www.fsf.org/blogs/community/201cthe-printer-story201d-redux-a-testimonial-about-the-injustice-of-proprietary-firmware">famoso berrinche</a> porque no le dejaban cambiar el firmware de una impresora.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Se puede argumentar que esos otros atributos podrían garantizarse si de hecho existiera el acceso al código, pero centrar el activismo en la libertad de código como un fin al que todo otro derecho es subsidiario, es como proponer que la mejor manera de combatir el cambio climático es desmantelar el capitalismo.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Puede considerarse que copyleft <i>es</i> un mecanismo de reproducción para el software libre, pero en la práctica parece más frecuentemente resultar en que se evite usarlo antes que en la adopción de sus condiciones.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
Aunque, estrictamente hablando, Linux sea software libre con una licencia copyleft restrictiva, su vigencia se debe justamente a que esa licencia no previene la producción de software cerrado: se puede desarrollar y deployar software privado usando Linux, sin obligaciones hacia los usuarios finales de ese software.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
Es curioso que, pese a esquivar la ideología y a adoptar una postura explícitamente pro-mercado, el open source terminó haciendo una mayor contribución que el software libre a la mirada anticapitalista, por ser un mejor ejemplo de innovación sin incentivos económicos.
</p></div></div>


</div>
</div>
